themes/adminLTE/comprobante-egreso/index_consulta.php

    function mostrarfiltro() {
        divC = document.getElementById("filtro");
        if (divC.style.display == "none"){divC.style.display = "block";}else{divC.style.display = "none";}
    }
</script>

<!--<h1>Lista Facturas</h1>-->
<?php $formulario = ActiveForm::begin([
    "method" => "get",
    "action" => Url::toRoute("comprobante-egreso/indexconsulta"),
    "enableClientValidation" => true,
    'options' => ['class' => 'form-horizontal'],
    'fieldConfig' => [
                    'template' => '{label}<div class="col-sm-4 form-group">{input}{error}</div>',
                    'labelOptions' => ['class' => 'col-sm-2 control-label'],
                    'options' => []
                ],

]);

$proveedores = ArrayHelper::map(Proveedor::find()->orderBy('nombrecorto ASC')->all(), 'idproveedor', 'nombreProveedores');
$tipos = ArrayHelper::map(ComprobanteEgresoTipo::find()->orderBy('concepto ASC')->all(), 'id_comprobante_egreso_tipo', 'concepto');
---
SELECT * FROM `proveedor` ORDER BY `nombrecorto`
SELECT * FROM `comprobante_egreso_tipo` ORDER BY `concepto`