themes/adminLTE/notacredito/index.php


<?php $newButton = Html::a('Nuevo ' . Html::tag('i', '', ['class' => 'glyphicon glyphicon-plus']), ['create'], ['class' => 'btn btn-success']);?>

<?= GridView::widget([
    'dataProvider' => $dataProvider,
    'filterModel' => $searchModel,
    'columns' => [
        [
            'attribute' => 'idnotacredito',
            'contentOptions' => ['class' => 'col-sm-1'],
        ],
        [
            'attribute' => 'idcliente',
            'value' => function($model){
                $clientes = Cliente::findOne($model->idcliente);
                return "{$clientes->nombrecorto} - {$clientes->cedulanit}";
            },
            'filter' => ArrayHelper::map(Cliente::find()->all(),'idcliente','nombreClientes'),
            'contentOptions' => ['class' => 'col-lg-2'],
        ],
        [
            'attribute' => 'idconceptonota',
            'value' => function($model){
                $conceptos = Conceptonota::findOne($model->idconceptonota);
                return "{$conceptos->concepto}";
            },
            'filter' => ArrayHelper::map(Conceptonota::find()->all(),'idconceptonota','concepto'),
---
SELECT COUNT(*) FROM `notacredito`
SELECT * FROM `cliente`
SELECT * FROM `conceptonota`

                    $notascredito = Notacredito::findOne($model->idnotacredito);
                    return $notascredito->autorizar;
                },
                'filter' => ArrayHelper::map(Notacredito::find()->all(),'autorizado','autorizar'),
---
SELECT * FROM `notacredito`