themes/adminLTE/cuenta-pub/index.php

            $cuenta = CuentaPub::findOne($model->codigo_cuenta);
            return $cuenta->permitem;
        },
        'filter' => ArrayHelper::map(CuentaPub::find()->all(),'permite_movimientos','permitem'),
---
SELECT * FROM `cuenta_pub`

            $cuenta = CuentaPub::findOne($model->codigo_cuenta);
            return $cuenta->exigen;
        },
        'filter' => ArrayHelper::map(CuentaPub::find()->all(),'exige_nit','exigen'),
---
SELECT * FROM `cuenta_pub`

            $cuenta = CuentaPub::findOne($model->codigo_cuenta);
            return $cuenta->exigecc;
        },
        'filter' => ArrayHelper::map(CuentaPub::find()->all(),'exige_centro_costo','exigecc'),
---
SELECT * FROM `cuenta_pub`


    <?php $newButton = Html::a('Nuevo ' . Html::tag('i', '', ['class' => 'glyphicon glyphicon-plus']), ['create'], ['class' => 'btn btn-success']);?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,

        'columns' => [
            [
                'attribute' => 'codigo_cuenta',
                'contentOptions' => ['class' => 'col-lg-2'],
            ],
            [
                'attribute' => 'nombre_cuenta',
                'contentOptions' => ['class' => 'col-lg-3'],
            ],
            [
                'attribute' => 'permite_movimientos',
                'value' => function($model){
                    $cuenta = CuentaPub::findOne($model->codigo_cuenta);
                    return $cuenta->permitem;
                },
                'filter' => ArrayHelper::map(CuentaPub::find()->all(),'permite_movimientos','permitem'),
                'contentOptions' => ['class' => 'col-lg-2'],
            ],
            [
                'attribute' => 'exige_nit',
                'value' => function($model){
                    $cuenta = CuentaPub::findOne($model->codigo_cuenta);
                    return $cuenta->exigen;
                },
                'filter' => ArrayHelper::map(CuentaPub::find()->all(),'exige_nit','exigen'),
---
SELECT * FROM `cuenta_pub` LIMIT 20
SELECT COUNT(*) FROM `cuenta_pub`
SELECT * FROM `cuenta_pub` WHERE `codigo_cuenta`='1'
SELECT * FROM `cuenta_pub`

            [
                'attribute' => 'exige_centro_costo',
                'value' => function($model){
                    $cuenta = CuentaPub::findOne($model->codigo_cuenta);
                    return $cuenta->exigecc;
                },
                'filter' => ArrayHelper::map(CuentaPub::find()->all(),'exige_centro_costo','exigecc'),
---
SELECT * FROM `cuenta_pub` WHERE `codigo_cuenta`='1'
SELECT * FROM `cuenta_pub`