controllers/ClientesController.php

    public function actionIndex_consulta() {
        if (Yii::$app->user->identity){
        if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',27])->all()){
            $form = new FormFiltroConsultaCliente;
            $cedulanit = null;
            $nombrecorto = null;
            if ($form->load(Yii::$app->request->get())) {
                if ($form->validate()) {
                    $cedulanit = Html::encode($form->cedulanit);
                    $nombrecorto = Html::encode($form->nombrecorto);
                    $table = Cliente::find()
                            ->andFilterWhere(['like', 'cedulanit', $cedulanit])
                            ->andFilterWhere(['like', 'nombrecorto', $nombrecorto])
                            ->orderBy('idcliente desc');
                    $tableexcel = $table->all();
                    $count = clone $table;
                    $to = $count->count();
                    $pages = new Pagination([
                        'pageSize' => 10,
                        'totalCount' => $count->count()
                    ]);
                    $model = $table
                            ->offset($pages->offset)
                            ->limit($pages->limit)
                            ->all();
---
SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 27)
SELECT * FROM `cliente` WHERE `nombrecorto` LIKE '%JOSE%' ORDER BY `idcliente` DESC
SELECT COUNT(*) FROM `cliente` WHERE `nombrecorto` LIKE '%JOSE%'
SELECT COUNT(*) FROM `cliente`
SELECT * FROM `cliente` WHERE `nombrecorto` LIKE '%JOSE%' ORDER BY `idcliente` DESC LIMIT 10

            } else {
                $table = Cliente::find()
                        ->orderBy('idcliente desc');
                $tableexcel = $table->all();
---
SELECT * FROM `cliente` ORDER BY `idcliente` DESC

    public function actionCumpleanos() {
        if (Yii::$app->user->identity){
            if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',17])->all()){
                $form = new \app\models\FormFiltroCumpleanos();
                $mes = null;
                $mensaje = '';
                if ($form->load(Yii::$app->request->get())) {
                    if ($form->validate()) {
                        $mes = Html::encode($form->mes);
                        $table = Cliente::find()->orderBy('idcliente desc');
                        $count = clone $table;
                        $to = $count->count();
                        $pages = new Pagination([
                            'pageSize' => 10,
                            'totalCount' => $count->count()
                        ]);
                        $model = $table
                                ->offset($pages->offset)
                                ->limit($pages->limit)
                                ->all();

                    } else {
                        $form->getErrors();
                    }
                } else {
                    $table = Cliente::find()
                            ->orderBy('idcliente desc');
                    $count = clone $table;
                    $pages = new Pagination([
                        'pageSize' => 10,
                        'totalCount' => $count->count(),
                    ]);
---
SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 17)
SELECT * FROM `cliente` ORDER BY `idcliente` DESC LIMIT 10
SELECT COUNT(*) FROM `cliente`

    public function actionViewconsulta($id)
        {
        $proceso = \app\models\Demandas::find()->where(['=','idcliente', $id])->orderBy('fecha_presentacion DESC')->all();
        $facturas = \app\models\Facturaventa::find()->where(['=','idcliente', $id])->orderBy('fecha_inicio DESC')->all();
        $table = Cliente::find()->where(['idcliente' => $id])->one();
---
SELECT * FROM `demandas` WHERE `idcliente` = '42' ORDER BY `fecha_presentacion` DESC
SELECT * FROM `facturaventa` WHERE `idcliente` = '42' ORDER BY `fecha_inicio` DESC
SELECT * FROM `cliente` WHERE `idcliente`='42'