controllers/ClientesController.php

    public function actionCumpleanos() {
        if (Yii::$app->user->identity){
            if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',17])->all()){
                $form = new \app\models\FormFiltroCumpleanos();
                $mes = null;
                $mensaje = '';
                if ($form->load(Yii::$app->request->get())) {
                    if ($form->validate()) {
                        $mes = Html::encode($form->mes);
                        $table = Cliente::find()->orderBy('idcliente desc');
                        $count = clone $table;
                        $to = $count->count();
                        $pages = new Pagination([
                            'pageSize' => 10,
                            'totalCount' => $count->count()
                        ]);
                        $model = $table
                                ->offset($pages->offset)
                                ->limit($pages->limit)
                                ->all();
---
SELECT * FROM `cliente` ORDER BY `idcliente` DESC LIMIT 10
SELECT COUNT(*) FROM `cliente`