controllers/CompraConceptoController.php

    public function actionIndex()
    {
        if (Yii::$app->user->identity){
            if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',33])->all()){
---
SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 33)

    public function actionView($id)
    {
        $modeldetalles = CompraConceptoCuenta::find()->Where(['=', 'id_compra_concepto', $id])->all();
---
SELECT * FROM `compra_concepto_cuenta` WHERE `id_compra_concepto` = '1'