controllers/CompraController.php

SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 29)
---
    public function actionIndexconsulta() {
        if (Yii::$app->user->identity){
        if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',29])->all()){

SELECT * FROM `compra` ORDER BY `id_compra` DESC
---
            } else {
                $table = Compra::find()
                        ->orderBy('id_compra desc');
                $tableexcel = $table->all();