controllers/ComprobanteEgresoController.php

SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 31)
SELECT COUNT(*) FROM `comprobante_egreso`
---
    public function actionIndexconsulta() {
        if (Yii::$app->user->identity){
        if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',31])->all()){
            $form = new FormFiltroConsultaComprobanteegreso();
            $idproveedor = null;
            $desde = null;
            $hasta = null;
            $numero = null;
            $tipo = null;
            if ($form->load(Yii::$app->request->get())) {
                if ($form->validate()) {
                    $idproveedor = Html::encode($form->idproveedor);
                    $desde = Html::encode($form->desde);
                    $hasta = Html::encode($form->hasta);
                    $numero = Html::encode($form->numero);
                    $tipo = Html::encode($form->tipo);
                    $table = ComprobanteEgreso::find()
                            ->andFilterWhere(['=', 'id_proveedor', $idproveedor])
                            ->andFilterWhere(['>=', 'fecha_comprobante', $desde])
                            ->andFilterWhere(['<=', 'fecha_comprobante', $hasta])
                            ->andFilterWhere(['=', 'numero', $numero])
                            ->andFilterWhere(['=', 'id_comprobante_egreso_tipo', $tipo]);
                    $table = $table->orderBy('id_comprobante_egreso desc');
                    $tableexcel = $table->all();
                    $count = clone $table;
                    $to = $count->count();
                    $pages = new Pagination([
                        'pageSize' => 20,
                        'totalCount' => $count->count()
                    ]);
                    $model = $table
                            ->offset($pages->offset)
                            ->limit($pages->limit)
                            ->all();

SELECT * FROM `comprobante_egreso` ORDER BY `id_comprobante_egreso` DESC
---
            } else {
                $table = ComprobanteEgreso::find()
                        ->orderBy('id_comprobante_egreso desc');
                $tableexcel = $table->all();