controllers/ComprobanteEgresoTipoController.php

SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 26)
---
    public function actionIndex()
    {
        if (Yii::$app->user->identity){
            if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',26])->all()){

SELECT * FROM `comprobante_egreso_tipo_cuenta` WHERE `id_comprobante_egreso_tipo` = '2'
---
    public function actionView($id)
    {
        $modeldetalles = ComprobanteEgresoTipoCuenta::find()->Where(['=', 'id_comprobante_egreso_tipo', $id])->all();