controllers/ContabilidadComprobanteTipoController.php

    public function actionIndex()
    {
        if (Yii::$app->user->identity){
            if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',34])->all()){
---
SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 34)