controllers/ContabilizarController.php

    public function actionContabilizar() {
        if (Yii::$app->user->identity){
        if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',33])->all()){
---
SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 33)

            } else {
                $table = Contabilidad::find()->where(['=','consecutivo', 0])
                        ->orderBy('fecha asc');
                $exportar = $table->all();
---
SELECT * FROM `contabilidad` WHERE `consecutivo` = 0 ORDER BY `fecha`