controllers/DocumentoEquivalenteController.php

SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 35)
---
    public function actionIndex()
    {
        if (Yii::$app->user->identity){
            if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',35])->all()){