controllers/EmpresaController.php

SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 23)
---
    public function actionEmpresa($id)
    {
        if (Yii::$app->user->identity){
            if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',23])->all()){

SELECT * FROM `matriculaempresa` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Matriculaempresa::findOne($id)) !== null) {