controllers/FacturaventaController.php

SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 14)
SELECT COUNT(*) FROM `facturaventa`
---
    public function actionIndex() {
        if (Yii::$app->user->identity){
        if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',14])->all()){
            $form = new FormFiltroFacturaVenta();
            $idcliente = null;
            $nro_factura = null;
            $fecha_inicio = null;
            $fecha_vencimiento = null;
            $tipo_factura= NULL;
            if ($form->load(Yii::$app->request->get())) {
                if ($form->validate()) {
                    $idcliente = Html::encode($form->idcliente);
                    $nro_factura = Html::encode($form->nro_factura);
                    $fecha_inicio = Html::encode($form->fecha_inicio);
                    $fecha_vencimiento = Html::encode($form->fecha_vencimiento);
                    $tipo_factura = Html::encode($form->tipo_factura);
                    $table = Facturaventa::find()
                            ->andFilterWhere(['=', 'idcliente', $idcliente])
                            ->andFilterWhere(['=', 'nro_factura', $nro_factura])
                            ->andFilterWhere(['>=', 'fecha_inicio', $fecha_inicio])
                            ->andFilterWhere(['<=', 'fecha_inicio', $fecha_vencimiento])
                            ->andFilterWhere(['=', 'tipo_factura', $tipo_factura]);
                    $table = $table->orderBy('idfactura desc');
                    $tableexcel = $table->all();
                    $count = clone $table;
                    $to = $count->count();
                    $pages = new Pagination([
                        'pageSize' => 25,
                        'totalCount' => $count->count()
                    ]);
                    $model = $table
                            ->offset($pages->offset)
                            ->limit($pages->limit)
                            ->all();

SELECT * FROM `facturaventa` ORDER BY `idfactura` DESC
---
            } else {
                $table = Facturaventa::find()
                        ->orderBy('idfactura desc');
                $tableexcel = $table->all();