controllers/ProveedorController.php

    public function actionIndex() {
        if (Yii::$app->user->identity){
            if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',15])->all()){
                $form = new FormFiltroProveedor;
                $cedulanit = null;
                $nombrecorto = null;
                if ($form->load(Yii::$app->request->get())) {
                    if ($form->validate()) {
                        $cedulanit = Html::encode($form->cedulanit);
                        $nombrecorto = Html::encode($form->nombrecorto);
                        $table = proveedor::find()
                                ->andFilterWhere(['like', 'cedulanit', $cedulanit])
                                ->andFilterWhere(['like', 'nombrecorto', $nombrecorto])
                                ->orderBy('idproveedor desc');
                        $count = clone $table;
                        $to = $count->count();
                        $pages = new Pagination([
                            'pageSize' => 10,
                            'totalCount' => $count->count()
                        ]);
                        $model = $table
                                ->offset($pages->offset)
                                ->limit($pages->limit)
                                ->all();
                    } else {
                        $form->getErrors();
                    }
                } else {
                    $table = Proveedor::find()
                            ->orderBy('idproveedor desc');
                    $count = clone $table;
                    $pages = new Pagination([
                        'pageSize' => 10,
                        'totalCount' => $count->count(),
                    ]);
---
SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 15)
SELECT * FROM `proveedor` ORDER BY `idproveedor` DESC LIMIT 10
SELECT COUNT(*) FROM `proveedor`