controllers/RecibocajaController.php

SELECT * FROM `usuario_detalle` WHERE (`codusuario` = 1) AND (`id_permiso` = 30)
SELECT COUNT(*) FROM `recibocaja`
---
    public function actionIndexconsulta() {
        if (Yii::$app->user->identity){
        if (UsuarioDetalle::find()->where(['=','codusuario', Yii::$app->user->identity->codusuario])->andWhere(['=','id_permiso',30])->all()){
            $form = new FormFiltroConsultaRecibocaja();
            $idcliente = null;
            $desde = null;
            $hasta = null;
            $numero = null;
            $tipo = null;
            if ($form->load(Yii::$app->request->get())) {
                if ($form->validate()) {
                    $idcliente = Html::encode($form->idcliente);
                    $desde = Html::encode($form->desde);
                    $hasta = Html::encode($form->hasta);
                    $numero = Html::encode($form->numero);
                    $tipo = Html::encode($form->tipo);
                    $table = Recibocaja::find()
                            ->andFilterWhere(['=', 'idcliente', $idcliente])
                            ->andFilterWhere(['>=', 'fechapago', $desde])
                            ->andFilterWhere(['<=', 'fechapago', $hasta])
                            ->andFilterWhere(['=', 'numero', $numero])
                            ->andFilterWhere(['=', 'idtiporecibo', $tipo]);
                    $table = $table->orderBy('idrecibo desc');
                    $tableexcel = $table->all();
                    $count = clone $table;
                    $to = $count->count();
                    $pages = new Pagination([
                        'pageSize' => 20,
                        'totalCount' => $count->count()
                    ]);
                    $model = $table
                            ->offset($pages->offset)
                            ->limit($pages->limit)
                            ->all();

SELECT * FROM `recibocaja` ORDER BY `idrecibo` DESC
---
            } else {
                $table = Recibocaja::find()
                        ->orderBy('idrecibo desc');
                $tableexcel = $table->all();