controllers/SiteController.php

    public function actionUsers() {
        //if (!Yii::$app->user->isGuest) {
        $form = new FormFiltroUsuario;
        $nombreusuario = null;
        $documentousuario = null;
        $nombrecompleto = null;
        if ($form->load(Yii::$app->request->get())) {
            if ($form->validate()) {
                $nombreusuario = Html::encode($form->nombreusuario);
                $documentousuario = Html::encode($form->documentousuario);
                $nombrecompleto = Html::encode($form->nombrecompleto);
                $table = Users::find()
                        ->andFilterWhere(['like', 'username', $nombreusuario])
                        ->andFilterWhere(['like', 'documentousuario', $documentousuario])
                        ->andFilterWhere(['like', 'nombrecompleto', $nombrecompleto])
                        ->orderBy('codusuario desc');
                $count = clone $table;
                $to = $count->count();
                $pages = new Pagination([
                    'pageSize' => 30,
                    'totalCount' => $count->count()
                ]);
                $model = $table
                        ->offset($pages->offset)
                        ->limit($pages->limit)
                        ->all();
            } else {
                $form->getErrors();
            }
        } else {
            $table = Users::find()
                    ->orderBy('codusuario desc');
            $count = clone $table;
            $pages = new Pagination([
                'pageSize' => 30,
                'totalCount' => $count->count(),
            ]);
---
SELECT * FROM `usuario` ORDER BY `codusuario` DESC LIMIT 30
SELECT COUNT(*) FROM `usuario`

    public function actionView($id) {
        $usuariodetalles = UsuarioDetalle::find()->where(['=','codusuario',$id])->all();
---
SELECT * FROM `usuario_detalle` WHERE `codusuario` = '1'