themes/adminLTE/contabilizar/contabilizar.php

SELECT * FROM `contabilidad_comprobante_tipo`
---
    function mostrarfiltro() {
        divC = document.getElementById("filtrocontabilizar");
        if (divC.style.display == "none"){divC.style.display = "block";}else{divC.style.display = "none";}
    }
</script>

<!--<h1>Lista Clientes</h1>-->
<?php $formulario = ActiveForm::begin([
    "method" => "get",
    "action" => Url::toRoute("contabilizar/contabilizar"),
    "enableClientValidation" => true,
    'options' => ['class' => 'form-horizontal'],
    'fieldConfig' => [
                    'template' => '{label}<div class="col-sm-4 form-group">{input}{error}</div>',
                    'labelOptions' => ['class' => 'col-sm-2 control-label'],
                    'options' => []
                ],

]);


$tipos = ArrayHelper::map(ContabilidadComprobanteTipo::find()->all(), 'codigo', 'tipo');