themes/adminLTE/compra-concepto/index.php


    <?php $newButton = Html::a('Nuevo ' . Html::tag('i', '', ['class' => 'glyphicon glyphicon-plus']), ['create'], ['class' => 'btn btn-success']);?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,

        'columns' => [
            [
                'attribute' => 'id_compra_concepto',
                'contentOptions' => ['class' => 'col-lg-1'],
            ],
            [
                'attribute' => 'concepto',
                'contentOptions' => ['class' => 'col-lg-2.5'],
            ],
            [
                'attribute' => 'id_compra_tipo',
                'value' => function($model){
                    $tipo = CompraTipo::findOne($model->id_compra_tipo);
                    return $tipo->tipo;
                },
                'filter' => ArrayHelper::map(CompraTipo::find()->all(),'id_compra_tipo','tipo'),
                'contentOptions' => ['class' => 'col-lg-1'],
            ],
---
SELECT * FROM `compra_concepto` LIMIT 20
SELECT COUNT(*) FROM `compra_concepto`
SELECT * FROM `compra_tipo` WHERE `id_compra_tipo`=2
SELECT * FROM `compra_tipo`