themes/adminLTE/formato-contenido/index.php


    <?php $newButton = Html::a('Nuevo ' . Html::tag('i', '', ['class' => 'glyphicon glyphicon-plus']), ['create'], ['class' => 'btn btn-success']); ?>

    <?=
    GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            [
                'attribute' => 'id_formato_contenido',
                'contentOptions' => ['class' => 'col-lg-1'],
            ],
            [
                'attribute' => 'nombre_formato',
                'contentOptions' => ['class' => 'col-lg-4.5'],
            ],
            [
                'attribute' => 'id_configuracion_prefijo',
                'value' => function($model){
                   $nombreprefijo = ConfiguracionFormatoPrefijo::findOne($model->id_configuracion_prefijo);
                   return $nombreprefijo->formato;
                },
                'filter' => ArrayHelper::map(ConfiguracionFormatoPrefijo::find()->all(),'id_configuracion_prefijo','formato'),
                'contentOptions' => ['class' => 'col-lg-2'],
            ],
            [
---
SELECT * FROM `formato_contenido` LIMIT 20
SELECT COUNT(*) FROM `formato_contenido`
SELECT * FROM `configuracion_formato_prefijo` WHERE `id_configuracion_prefijo`=2
SELECT * FROM `configuracion_formato_prefijo`