themes/adminLTE/site/index.php

use yii\bootstrap\Html;
use app\models\Matriculaempresa;
/* @var $this yii\web\View */
$empresa = Matriculaempresa::findOne(1);
---
SELECT * FROM `matriculaempresa` WHERE `id`=1