themes/adminLTE/site/main-login.php

<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css" integrity="sha384-1q8mTJOASx8j1Au+a5WDVnPi2lkFfwwEAa8hDDdjZlpLegxhjVME1fgjWPGmkzs7" crossorigin="anonymous">
<div class="login-box">
    <div class="login-logo">
        <?php $empresa = Matriculaempresa::findOne(1) ;?>
---
SELECT * FROM `matriculaempresa` WHERE `id`=1