themes/adminLTE/empresa/empresa.php

        ]);
?>
<?php
$resoluciones = ArrayHelper::map(Resolucion::find()->all(), 'idresolucion', 'descripcion');
$bancos = ArrayHelper::map(Banco::find()->all(), 'idbanco', 'nombrecuenta');
$regimen = ArrayHelper::map(TipoRegimen::find()->all(), 'id_tipo_regimen', 'regimen');
$departamento = ArrayHelper::map(Departamento::find()->all(), 'iddepartamento', 'departamento');
$municipio = ArrayHelper::map(Municipio::find()->all(), 'idmunicipio', 'municipio');
---
SELECT * FROM `resolucion`
SELECT * FROM `banco`
SELECT * FROM `tipo_regimen`
SELECT * FROM `departamento`
SELECT * FROM `municipio`