themes/adminLTE/comprobante-egreso-tipo/index.php

SELECT * FROM `comprobante_egreso_tipo` LIMIT 20
SELECT COUNT(*) FROM `comprobante_egreso_tipo`
SELECT * FROM `comprobante_egreso_tipo` WHERE `id_comprobante_egreso_tipo`=2
SELECT * FROM `comprobante_egreso_tipo`
---

    <?php $newButton = Html::a('Nuevo ' . Html::tag('i', '', ['class' => 'glyphicon glyphicon-plus']), ['create'], ['class' => 'btn btn-success']);?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,

        'columns' => [
            [
                'attribute' => 'id_comprobante_egreso_tipo',
                'contentOptions' => ['class' => 'col-lg-3'],
            ],
            [
                'attribute' => 'concepto',
                'contentOptions' => ['class' => 'col-lg-5'],
            ],
            [
                'attribute' => 'activo',
                'value' => function($model){
                    $tipo = app\models\ComprobanteEgresoTipo::findOne($model->id_comprobante_egreso_tipo);
                    return $tipo->estado;
                },
                'filter' => ArrayHelper::map(app\models\ComprobanteEgresoTipo::find()->all(),'activo','estado'),
                'contentOptions' => ['class' => 'col-lg-3'],
            ],