themes/adminLTE/contabilidad-comprobante-tipo/index.php


    <?php $newButton = Html::a('Nuevo ' . Html::tag('i', '', ['class' => 'glyphicon glyphicon-plus']), ['create'], ['class' => 'btn btn-success']);?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,

        'columns' => [
            [
                'attribute' => 'id_contabilidad_comprobante_tipo',
                'contentOptions' => ['class' => 'col-lg-2'],
            ],
            [
                'attribute' => 'tipo',
                'contentOptions' => ['class' => 'col-lg-3'],
            ],
            [
                'attribute' => 'codigo',
                'contentOptions' => ['class' => 'col-lg-3'],
            ],
            [
                'attribute' => 'estado',
                'value' => function($model){
                    $tipo = ContabilidadComprobanteTipo::findOne($model->id_contabilidad_comprobante_tipo);
                    return $tipo->activo;
                },
                'filter' => ArrayHelper::map(app\models\ComprobanteEgresoTipo::find()->all(),'estado','activo'),
---
SELECT * FROM `contabilidad_comprobante_tipo` LIMIT 20
SELECT COUNT(*) FROM `contabilidad_comprobante_tipo`
SELECT * FROM `contabilidad_comprobante_tipo` WHERE `id_contabilidad_comprobante_tipo`=1
SELECT * FROM `comprobante_egreso_tipo`