themes/adminLTE/tipo-recibo/index.php


    <?php $newButton = Html::a('Nuevo ' . Html::tag('i', '', ['class' => 'glyphicon glyphicon-plus']), ['create'], ['class' => 'btn btn-success']); ?>

    <?=
    GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            [
                'attribute' => 'idtiporecibo',
                'contentOptions' => ['class' => 'col-lg-3'],
            ],
            [
                'attribute' => 'concepto',
                'contentOptions' => ['class' => 'col-lg-5'],
            ],
            [
                'attribute' => 'activo',
                'value' => function($model) {
                    $orden = TipoRecibo::findOne($model->idtiporecibo);
                    return $orden->estado;
                },
                'filter' => ArrayHelper::map(TipoRecibo::find()->all(), 'activo', 'estado'),
                'contentOptions' => ['class' => 'col-lg-3'],
            ],
            [
---
SELECT * FROM `tiporecibo` ORDER BY `concepto` LIMIT 20
SELECT COUNT(*) FROM `tiporecibo`
SELECT * FROM `tiporecibo` WHERE `idtiporecibo`=10
SELECT * FROM `tiporecibo`