models/User.php

SELECT * FROM `usuario` WHERE (activo=1) AND (codusuario=1)
---
    public static function findIdentity($codusuario)
    {

        $user = Users::find()
            ->where("activo=:activo", [":activo" => 1])
            ->andWhere("codusuario=:codusuario", ["codusuario" => $codusuario])
            ->one();